#+TITLE:  README


* Links
- https://artifacthub.io/packages/helm/argo/argo-cd
- https://github.com/argoproj/argo-helm/tree/main/charts/argo-cd
- https://argo-cd.readthedocs.io/en/stable/user-guide/helm/


* Install

  #+begin_src shell
    helm repo add argo https://argoproj.github.io/argo-helm  
  #+end_src

  #+RESULTS:
  | argo already exists with the same configuration | skipping |

  #+begin_src shell
    helm upgrade --install --create-namespace --namespace argocd my-argo-cd argo/argo-cd --values ./values.yaml
  #+end_src

  #+RESULTS:
  | Release    | my-argo-cd | has          | been                             | upgraded. | Happy                       | Helming!              |                                                                                                          |           |        |             |           |           |        |                                                                                                |        |          |                                                                                                                             |        |     |               |     |     |      |     |          |    |          |
  | NAME:      | my-argo-cd |              |                                  |           |                             |                       |                                                                                                          |           |        |             |           |           |        |                                                                                                |        |          |                                                                                                                             |        |     |               |     |     |      |     |          |    |          |
  | LAST       | DEPLOYED:  | Thu          | Sep                              | 15        | 22:40:36                    | 2022                  |                                                                                                          |           |        |             |           |           |        |                                                                                                |        |          |                                                                                                                             |        |     |               |     |     |      |     |          |    |          |
  | NAMESPACE: | argocd     |              |                                  |           |                             |                       |                                                                                                          |           |        |             |           |           |        |                                                                                                |        |          |                                                                                                                             |        |     |               |     |     |      |     |          |    |          |
  | STATUS:    | deployed   |              |                                  |           |                             |                       |                                                                                                          |           |        |             |           |           |        |                                                                                                |        |          |                                                                                                                             |        |     |               |     |     |      |     |          |    |          |
  | REVISION:  | 13         |              |                                  |           |                             |                       |                                                                                                          |           |        |             |           |           |        |                                                                                                |        |          |                                                                                                                             |        |     |               |     |     |      |     |          |    |          |
  | TEST       | SUITE:     | None         |                                  |           |                             |                       |                                                                                                          |           |        |             |           |           |        |                                                                                                |        |          |                                                                                                                             |        |     |               |     |     |      |     |          |    |          |
  | NOTES:     |            |              |                                  |           |                             |                       |                                                                                                          |           |        |             |           |           |        |                                                                                                |        |          |                                                                                                                             |        |     |               |     |     |      |     |          |    |          |
  | In         | order      | to           | access                           | the       | server                      | UI                    | you                                                                                                      | have      | the    | following   | options:  |           |        |                                                                                                |        |          |                                                                                                                             |        |     |               |     |     |      |     |          |    |          |
  | 1          | kubectl    | port-forward | service/my-argo-cd-argocd-server | -n        | argocd                      | 8080:443              |                                                                                                          |           |        |             |           |           |        |                                                                                                |        |          |                                                                                                                             |        |     |               |     |     |      |     |          |    |          |
  | and        | then       | open         | the                              | browser   | on                          | http://localhost:8080 | and                                                                                                      | accept    | the    | certificate |           |           |        |                                                                                                |        |          |                                                                                                                             |        |     |               |     |     |      |     |          |    |          |
  | 2          | enable     | ingress      | in                               | the       | values                      | file                  | `server.ingress.enabled`                                                                                 | and       | either |             |           |           |        |                                                                                                |        |          |                                                                                                                             |        |     |               |     |     |      |     |          |    |          |
  | -          | Add        | the          | annotation                       | for       | ssl                         | passthrough:          | https://github.com/argoproj/argo-cd/blob/master/docs/operator-manual/ingress.md#option-1-ssl-passthrough |           |        |             |           |           |        |                                                                                                |        |          |                                                                                                                             |        |     |               |     |     |      |     |          |    |          |
  | -          | Add        | the          | `--insecure`                     | flag      | to                          | `server.extraArgs`    | in                                                                                                       | the       | values | file        | and       | terminate | SSL    | at                                                                                             | your   | ingress: | https://github.com/argoproj/argo-cd/blob/master/docs/operator-manual/ingress.md#option-2-multiple-ingress-objects-and-hosts |        |     |               |     |     |      |     |          |    |          |
  | After      | reaching   | the          | UI                               | the       | first                       | time                  | you                                                                                                      | can       | login  | with        | username: | admin     | and    | the                                                                                            | random | password | generated                                                                                                                   | during | the | installation. | You | can | find | the | password | by | running: |
  | kubectl    | -n         | argocd       | get                              | secret    | argocd-initial-admin-secret | -o                    | {.data.password}                                                                                         |           |        | base64      | -d        |           |        |                                                                                                |        |          |                                                                                                                             |        |     |               |     |     |      |     |          |    |          |
  | (You       | should     | delete       | the                              | initial   | secret                      | afterwards            | as                                                                                                       | suggested | by     | the         | Getting   | Started   | Guide: | https://github.com/argoproj/argo-cd/blob/master/docs/getting_started.md#4-login-using-the-cli) |        |          |                                                                                                                             |        |     |               |     |     |      |     |          |    |          |
